function uniteUnique(arr) {

    /* new Set - певертає обʼєкт з унікальними значеннями, 
    в якості аргументу передаємо масив з усіма аргументами переданими у функцію.
    Методом  flat() позбуваємось вкладеності. */
    
    let uniqueElements = new Set([...arguments].flat());
    return Array.from(uniqueElements); // перетоворюємо обʼєкт у масив
}

uniteUnique([1, 3, 2], [5, 2, 1, 4], [2, 1]); //[1, 3, 2, 5, 4]
uniteUnique([1, 2, 3], [5, 2, 1]); //[1, 2, 3, 5]
uniteUnique([1, 2, 3], [5, 2, 1, 4], [2, 1], [6, 7, 8]); //[1, 2, 3, 5, 4, 6, 7, 8]
uniteUnique([1, 3, 2], [5, 4], [5, 6]); //[1, 3, 2, 5, 4, 6]
uniteUnique([1, 3, 2, 3], [5, 2, 1, 4], [2, 1]); //[1, 3, 2, 5, 4]